In [2]:
%load_ext sql

In [3]:
%%sql sqlite://
--This is a SQL comment. This cell tells the SQL magic to "connect" to an in-memory SQLite database

0 rows affected.

[]

# Lesson 8.3 SQL Queries to Manage Tables

In [4]:
%%sql
DROP TABLE IF EXISTS Animal; -- allows you to run this cell repeatedly
CREATE TABLE Animal (
    type TEXT PRIMARY KEY,
    legs INTEGER CHECK (legs >= 0),
    weight INTEGER CHECK (weight >= 0)
);

 * sqlite://
Done.
Done.

[]

In [5]:
%%sql
DROP TABLE IF EXISTS Member; -- allows you to run this cell repeatedly
CREATE TABLE Member (
  athlete TEXT,
  esport TEXT,
  skill INTEGER,
  PRIMARY KEY(athlete, esport)
);

 * sqlite://
Done.
Done.

[]

# Lesson 8.4 SQL Queries for Rows
introduction to SQL queries

In [6]:
%%sql 
DROP TABLE IF EXISTS Dragon; -- allows you to run this cell repeatedly
CREATE TABLE Dragon (
    name TEXT PRIMARY KEY,
    year INTEGER CHECK (year >= 2000),
    cute INTEGER
);
INSERT INTO Dragon VALUES ('hiccup', 2010, 10);
INSERT INTO Dragon VALUES
    ('drogon', 2011, -100),
    ('dragon 2', 2019, 0);

 * sqlite://
Done.
Done.
1 rows affected.
2 rows affected.

[]

In [7]:
%%sql
SELECT year as birth
FROM Dragon AS Bird;

 * sqlite://
Done.

[(2010,), (2011,), (2019,)]

In [8]:
%%sql
SELECT *
FROM
    Dragon as Dragon1,
    Dragon as Dragon2;

 * sqlite://
Done.

[('hiccup', 2010, 10, 'hiccup', 2010, 10),
 ('hiccup', 2010, 10, 'drogon', 2011, -100),
 ('hiccup', 2010, 10, 'dragon 2', 2019, 0),
 ('drogon', 2011, -100, 'hiccup', 2010, 10),
 ('drogon', 2011, -100, 'drogon', 2011, -100),
 ('drogon', 2011, -100, 'dragon 2', 2019, 0),
 ('dragon 2', 2019, 0, 'hiccup', 2010, 10),
 ('dragon 2', 2019, 0, 'drogon', 2011, -100),
 ('dragon 2', 2019, 0, 'dragon 2', 2019, 0)]

In [9]:
%%sql
SELECT
    Dragon1.name,
    Dragon2.name
FROM
    Dragon as Dragon1,
    Dragon as Dragon2;

 * sqlite://
Done.

[('dragon 2', 'dragon 2'),
 ('dragon 2', 'drogon'),
 ('dragon 2', 'hiccup'),
 ('drogon', 'dragon 2'),
 ('drogon', 'drogon'),
 ('drogon', 'hiccup'),
 ('hiccup', 'dragon 2'),
 ('hiccup', 'drogon'),
 ('hiccup', 'hiccup')]

In [10]:
%%sql
SELECT name, year
FROM Dragon
WHERE cute > 0;

 * sqlite://
Done.

[('hiccup', 2010)]

In [11]:
%%sql
SELECT *
FROM Dragon
ORDER BY cute;

 * sqlite://
Done.

[('drogon', 2011, -100), ('dragon 2', 2019, 0), ('hiccup', 2010, 10)]

In [12]:
%%sql
SELECT *
FROM Dragon
LIMIT 2;

 * sqlite://
Done.

[('hiccup', 2010, 10), ('drogon', 2011, -100)]

In [13]:
%%sql
SELECT *
FROM Dragon
ORDER BY cute desc;

 * sqlite://
Done.

[('hiccup', 2010, 10), ('dragon 2', 2019, 0), ('drogon', 2011, -100)]

In [14]:
%%sql
SELECT *
FROM Dragon
LIMIT 2;

 * sqlite://
Done.

[('hiccup', 2010, 10), ('drogon', 2011, -100)]

In [15]:
%%sql
SELECT *
FROM Dragon
LIMIT 2
OFFSET 1;

 * sqlite://
Done.

[('drogon', 2011, -100), ('dragon 2', 2019, 0)]

# Lesson 8.5 SQL Queries for Groups

In [16]:
%%sql sqlite://
DROP TABLE IF EXISTS Dish;
CREATE TABLE Dish (
    name TEXT PRIMARY KEY,
    type TEXT,
    cost INTEGER CHECK (cost >= 0)
);
INSERT INTO Dish VALUES
    ('ravioli', 'entree', 10),
    ('pork bun', 'entree', 7),
    ('taco', 'entree', 7),
    ('edamame', 'appetizer', 4),
    ('fries', 'appetizer', 4),
    ('potsticker', 'appetizer', 4),
    ('ice cream', 'dessert', 5);

Done.
Done.
7 rows affected.

[]

In [17]:
%%sql
SELECT * FROM Dish;

 * sqlite://
Done.

[('ravioli', 'entree', 10),
 ('pork bun', 'entree', 7),
 ('taco', 'entree', 7),
 ('edamame', 'appetizer', 4),
 ('fries', 'appetizer', 4),
 ('potsticker', 'appetizer', 4),
 ('ice cream', 'dessert', 5)]

In [18]:
%%sql
SELECT type
FROM Dish
GROUP BY type;

 * sqlite://
Done.

[('appetizer',), ('dessert',), ('entree',)]

In [19]:
%%sql
SELECT COUNT(*)
FROM Dish;

 * sqlite://
Done.

[(7,)]

In [20]:
%%sql
SELECT type, COUNT(*)
FROM Dish
GROUP BY type;

 * sqlite://
Done.

[('appetizer', 3), ('dessert', 1), ('entree', 3)]

In [21]:
%%sql
SELECT type, cost
FROM Dish
GROUP BY type; -- cost column is meaningless. first cost of each group in this case.

 * sqlite://
Done.

[('appetizer', 4), ('dessert', 5), ('entree', 10)]

In [22]:
%%sql
SELECT type, COUNT(*), SUM(cost)
FROM Dish
GROUP BY type;

 * sqlite://
Done.

[('appetizer', 3, 12), ('dessert', 1, 5), ('entree', 3, 24)]

In [23]:
%%sql
SELECT DISTINCT type
FROM Dish;

 * sqlite://
Done.

[('entree',), ('appetizer',), ('dessert',)]

In [24]:
%%sql
SELECT DISTINCT cost
FROM Dish;

 * sqlite://
Done.

[(10,), (7,), (4,), (5,)]

In [25]:
%%sql
SELECT type, COUNT(DISTINCT cost)
FROM Dish
GROUP BY type;

 * sqlite://
Done.

[('appetizer', 1), ('dessert', 1), ('entree', 2)]

In [26]:
%%sql
SELECT type, AVG(cost)
FROM Dish
GROUP BY type;

 * sqlite://
Done.

[('appetizer', 4.0), ('dessert', 5.0), ('entree', 8.0)]

In [27]:
%%sql
SELECT type, AVG(cost) AS 'average'
FROM Dish
GROUP BY type
HAVING average > 5;

 * sqlite://
Done.

[('entree', 8.0)]

In [28]:
%%sql
--EXAMPLE DEBUG Q
SELECT type, AVG(cost) as 'average'
FROM Dish
GROUP BY type
HAVING cost > 4; -- why did this fail? (HAVING applies to group, and in this case, the original column cost was used. recall cost is effectively meaningless -- first cost of each group)

 * sqlite://
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: --EXAMPLE DEBUG Q SELECT type, AVG(cost) as 'average'
FROM Dish
GROUP BY type
HAVING cost > 4; -- why did this fail? (HAVING applies to group, and in this case, the original column cost was used. recall cost is effectively meaningless -- first cost of each group)]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [29]:
%%sql
--EXAMPLE DEBUG Q
SELECT type, AVG(cost) as 'average'
FROM dishes
WHERE cost > 4
GROUP BY type; -- understand why averages changed (where applies to rows before grouping)

 * sqlite://
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: --EXAMPLE DEBUG Q SELECT type, AVG(cost) as 'average'
FROM dishes
WHERE cost > 4
GROUP BY type; -- understand why averages changed (where applies to rows before grouping)]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

# Lesson 8.6 Practice: Write and Debug SQL Queries
**WARNING** Solutions are included below.

In [30]:
%%sql
DROP TABLE IF EXISTS Scene;
CREATE TABLE Scene (
    id INTEGER PRIMARY KEY AUTOINCREMENT, -- I didn't include autoinc in lecture, but you would normally do this 
    biome TEXT NOT NULL,
    city TEXT NOT NULL,
    visitors INTEGER CHECK (visitors >= 0),
    created_at DATETIME DEFAULT (DATETIME('now')) -- I didn't include the default in lecture, but here's how to populate on insert
);
INSERT INTO Scene (biome, city, visitors, created_at) VALUES
    ('desert', 'Las Vegas', 100 , '2021-01-01'),
    ('ocean' , 'Hawaii'   , 1000, '2021-01-02'),
    ('river' , 'Paris'    , 50  , '2021-01-05'),
    ('hotel' , 'Iceland'  , 1   , '2021-01-07'),
    ('desert', 'Austin'   , 25  , '2021-01-12'),
    ('hotel' , 'Las Vegas', 240 , '2021-01-15'),
    ('hotel' , 'Paris'    , 100 , '2021-01-15');

 * sqlite://
Done.
Done.
7 rows affected.

[]

In [31]:
%sql SELECT * from Scene;

 * sqlite://
Done.

[(1, 'desert', 'Las Vegas', 100, '2021-01-01'),
 (2, 'ocean', 'Hawaii', 1000, '2021-01-02'),
 (3, 'river', 'Paris', 50, '2021-01-05'),
 (4, 'hotel', 'Iceland', 1, '2021-01-07'),
 (5, 'desert', 'Austin', 25, '2021-01-12'),
 (6, 'hotel', 'Las Vegas', 240, '2021-01-15'),
 (7, 'hotel', 'Paris', 100, '2021-01-15')]

In [32]:
%%sql
SELECT COUNT(*) FROM Scene;

 * sqlite://
Done.

[(7,)]

In [33]:
%%sql
SELECT biome, COUNT(DISTINCT city)
FROM Scene
GROUP BY biome
ORDER BY COUNT(DISTINCT city) desc
LIMIT 1;

 * sqlite://
Done.

[('hotel', 3)]

In [34]:
%%sql
-- select pair of scenes with the most visitors
SELECT *, Scene1.visitors + Scene2.visitors AS 'sum'
FROM Scene AS Scene1, Scene AS Scene2
WHERE Scene1.biome != Scene2.biome OR Scene1.city != Scene2.city
ORDER BY sum desc
LIMIT 1;

 * sqlite://
Done.

[(2, 'ocean', 'Hawaii', 1000, '2021-01-02', 6, 'hotel', 'Las Vegas', 240, '2021-01-15', 1240)]

In [35]:
%%sql
-- how to fix the syntax error?
SELECT city
FROM Scene
GROUP BY city
WHERE visitors >= 125;

 * sqlite://
(sqlite3.OperationalError) near "WHERE": syntax error
[SQL: -- how to fix the syntax error?
SELECT city
FROM Scene
GROUP BY city
WHERE visitors >= 125;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [36]:
%%sql
-- fixed syntax error above
SELECT city
FROM Scene
WHERE visitors >= 125
GROUP BY city;

 * sqlite://
Done.

[('Hawaii',), ('Las Vegas',)]

In [37]:
%%sql
-- trying to select all cities with at least 125 visitors
-- include all scenes per city. (should include Las Vegas, Paris too)
-- what's wrong?
SELECT city
FROM Scene
WHERE visitors >= 125
GROUP BY city;

 * sqlite://
Done.

[('Hawaii',), ('Las Vegas',)]

In [38]:
%%sql
-- SOLN to above
SELECT city
FROM Scene
GROUP BY city
HAVING SUM(visitors) >= 125;

 * sqlite://
Done.

[('Hawaii',), ('Las Vegas',), ('Paris',)]

In [39]:
%%sql
--trying to compute the *biome that is least populated (for each biome, consider visitors across all cities)
--answer should Paris. Why Austin here?
--what's wrong?
SELECT city, visitors
FROM Scene
GROUP BY city
ORDER BY MIN(visitors)
LIMIT 1;

 * sqlite://
Done.

[('Iceland', 1)]

In [40]:
%%sql
--soln to above
SELECT city, SUM(visitors)
FROM Scene
GROUP BY city
ORDER BY SUM(visitors) asc
LIMIT 1;

 * sqlite://
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: --soln to above SELECT city, SUM(visitors)
FROM Scene
GROUP BY city
ORDER BY SUM(visitors) asc
LIMIT 1;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)